// pages/taxtable/taxtable.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    taxTable:[
      ["级数", "全月应纳税所得额", "税率(%)","速算扣除数"],
      [1, "不超过3000元的部分",3,0],
      [2, "超过3000元至12000元的部分",10,210],
      [3, "超过12000元至25000元的部分",20, 1410],
      [4, "超过25000元至35,000元的部分", 25, 2660],
      [5, "超过35,000元至55,000元的部分",30, 4410],
      [6, "超过55,000元至80,000元的部分",35, 7160],
      [7, "超过80,000元的部分",45, 15160]
    ],
    oldTaxTable: [
      ["级数", "全月应纳税所得额（含税级距）", "全月应纳税所得额（不含税级距）", "税率(%)", "速算扣除数"],
      [1, "不超过1,500元", "不超过1455元的", 3, 0],
      [2, "超过1,500元至4,500元的部分", "超过1455元至4155元的部分", 10, 105],
      [3, "超过4,500元至9,000元的部分", "超过4155元至7755元的部分", 20, 555],
      [4, "超过9,000元至35,000元的部分", "超过7755元至27255元的部分", 25, 1005],
      [5, "超过35,000元至55,000元的部分", "超过27255元至41255元的部分", 30, 2755],
      [6, "超过55,000元至80,000元的部分", "超过41255元至57505元的部分", 35, 5505],
      [7, "超过80,000元的部分", "超过57505元的部分", 45, 13505]
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})